"use strict";

// Преобразуйте объект в JSON, а затем обратно в обычный объект
// важность: 5
// Преобразуйте user в JSON, затем прочитайте этот JSON в другую переменную.

{
    let user = {
        name: "Василий Иванович",
        age: 35
    };

    const json = JSON.stringify(user);

    const user2 = JSON.parse(json);
}



//-----------------------------------------------------------------------------
// Исключить обратные ссылки
// важность: 5
// В простых случаях циклических ссылок мы можем исключить свойство, из-за которого они возникают, 
// из сериализации по его имени.

// Но иногда мы не можем использовать имя, так как могут быть и другие, нужные, 
// свойства с этим именем во вложенных объектах. Поэтому можно проверять свойство по значению.

// Напишите функцию replacer для JSON-преобразования, которая удалит свойства, ссылающиеся на meetup:


{

    let room = {
        number: 23
    };

    let meetup = {
        title: "Совещание",
        occupiedBy: [{ name: "Иванов" }, { name: "Петров" }],
        place: room
    };


    function replacer(key, value) {
        return (key != "" && value == meetup) ? undefined : value;
    }

    const x = JSON.stringify(meetup, replacer);
    console.log(x);

}